app/Controllers/AdminController.php

SELECT COUNT(*) AS `numrows` FROM `operateur_prefixes`
SELECT COUNT(*) AS `numrows` FROM `clients`
SELECT COUNT(*) AS `numrows` FROM `transactions`
---
    public function dashboard()
    {
        return view('admin/dashboard', [
            'totalOperators'    => $this->operateurPrefixeModel->countAll(),
            'totalClients'      => $this->clientModel->countAll(),
            'totalTransactions' => $this->transactionModel->countAll(),
        ]);

SELECT *
FROM `operateur_prefixes`
---
    public function operators()
    {
        return view('admin/operators', [
            'operators' => $this->operateurPrefixeModel->findAll(),
        ]);