app/Controllers/Api.php

SELECT *
FROM `clients`
WHERE `clients`.`id` = 3
---
    public function calculateFees()
    {
        if (!$this->session->get('isLoggedIn')) {
            return $this->response->setJSON([
                'success' => false,
                'message' => 'Non authentifié'
            ])->setStatusCode(401);
        }

        $typeCode = $this->request->getGet('type_code') ?? $this->request->getPost('type_code');
        $amount = (float)($this->request->getGet('amount') ?? $this->request->getPost('amount'));
        $recipientPhone = $this->request->getGet('recipient_phone') ?? $this->request->getPost('recipient_phone');
        $clientId = $this->session->get('client_id');

        if (!$typeCode || $amount <= 0 || !$clientId) {
            return $this->response->setJSON([
                'success' => false,
                'message' => 'Paramètres invalides'
            ]);
        }

        $client = $this->clientModel->find($clientId);