app/Controllers/AuthController.php

SELECT *
FROM `admin`
WHERE `email` = 'admin@gmail.com'
 LIMIT 1
---
    public function doLoginAdmin()
    {
        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        if (!empty($email) && !empty($password)) {
            $admin = $this->adminModel->where('email', $email)->first();