app/Controllers/Client.php

SELECT *
FROM `clients`
WHERE `clients`.`id` = 1
---
    public function balance()
    {
        if (!$this->checkAuth()) {
            return redirect()->to('/login');
        }

        $clientId = $this->session->get('client_id');
        $phone = $this->session->get('phone');

        $client = $this->clientModel->find($clientId);

SELECT *
FROM `clients`
WHERE `clients`.`id` = 1
---
    public function deposit()
    {
        if (!$this->checkAuth()) {
            return redirect()->to('/login');
        }

        $clientId = $this->session->get('client_id');
        $client = $this->clientModel->find($clientId);

SELECT *
FROM `clients`
WHERE `clients`.`id` = 3
---
    public function doWithdraw()
    {
        if (!$this->checkAuth()) {
            return redirect()->to('/login/client')->with('error', 'Non authentifié');
        }

        $amount = (float)$this->request->getPost('amount');
        $clientId = $this->session->get('client_id');

        if ($amount <= 0) {
            return redirect()->back()->withInput()->with('error', 'Montant invalide.');
        }

        $client = $this->clientModel->find($clientId);

SELECT *
FROM `clients`
WHERE `clients`.`id` = 3
---
    public function transfer()
    {
        if (!$this->checkAuth()) {
            return redirect()->to('/login');
        }

        $clientId = $this->session->get('client_id');
        $client = $this->clientModel->find($clientId);

SELECT *
FROM `clients`
WHERE `clients`.`id` = 3
---
    public function doTransfer()
    {
        if (!$this->checkAuth()) {
            return redirect()->to('/login/client')->with('error', 'Non authentifié');
        }

        $amount = (float)$this->request->getPost('amount');
        $senderId = $this->session->get('client_id');
        $senderPhone = $this->session->get('phone');
        $includeFees = $this->request->getPost('include_fees');
        $transferMode = $this->request->getPost('transfer_mode') ?? 'single';
        $recipientsRaw = $this->request->getPost('recipients');
        $recipientPhone = trim($this->request->getPost('recipient_phone') ?? '');

        if ($transferMode === 'multiple' && is_array($recipientsRaw)) {
            $recipients = array_filter(array_map('trim', $recipientsRaw), fn($p) => $p !== '');
        } else {
            $recipients = $recipientPhone !== '' ? [$recipientPhone] : [];
        }

        if ($amount <= 0) {
            return redirect()->back()->withInput()->with('error', 'Montant invalide.');
        }

        if (empty($recipients)) {
            return redirect()->back()->withInput()->with('error', 'Veuillez saisir au moins un numéro de destinataire.');
        }

        $sender = $this->clientModel->find($senderId);