app/Models/ClientModel.php

SELECT *
FROM `clients`
WHERE `telephone` = '0331234567'
 LIMIT 1
---
    public function getByTelephone(string $telephone)
    {
        return $this->where('telephone', $telephone)->first();

SELECT *
FROM `clients`
WHERE `telephone` = '0331234567'
AND `code` = '1234'
 LIMIT 1
---
    public function verifyClient(string $telephone, string $code)
    {
        return $this->where('telephone', $telephone)
                     ->where('code', $code)
                     ->first();